app/controllers/portfolios_controller.rb

    def index
        @portfolio_items = Portfolio.all
---
SELECT "portfolios".* FROM "portfolios"

    def create
        @portfolio_item = Portfolio.new(params.require(:portfolio).permit(:title, :subtitle, :body, technologies_attributes: [:name]))

        respond_to do |format|
            if @portfolio_item.save
---
INSERT INTO "portfolios" ("title", "subtitle", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "New portfolio item"], ["subtitle", "great item"], ["body", "Lorem Ipsum"], ["created_at", 2019-12-05 03:53:53 UTC], ["updated_at", 2019-12-05 03:53:53 UTC]]
INSERT INTO "technologies" ("name", "portfolio_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Rails "], ["portfolio_id", 14], ["created_at", 2019-12-08 06:56:41 UTC], ["updated_at", 2019-12-08 06:56:41 UTC]]

    def edit
        @portfolio_item = Portfolio.find(params[:id])
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @portfolio_item = Portfolio.find(params[:id])
        respond_to do |format|
            if @portfolio_item.update(params.require(:portfolio).permit(:title, :subtitle, :body))
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "portfolios" SET "subtitle" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["subtitle", "My service"], ["updated_at", 2019-12-05 04:06:12 UTC], ["id", 1]]

    def show
        @portfolio_item = Portfolio.find(params[:id])
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def destroy
        @portfolio_item = Portfolio.find(params[:id])
        @portfolio_item.destroy
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 2]]